app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
    def index
        render json: Article.all

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        render json:Article.find(params[:id])

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 3]]
---
    def destroy
        Article.find(params[:id]).destroy

INSERT INTO "articles" ("title", "comment", "picture", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", nil], ["comment", nil], ["picture", nil], ["created_at", "2024-05-22 12:24:50.296892"], ["updated_at", "2024-05-22 12:24:50.296892"]]
---
    def create
        article = Article.create!(article_params)